import React from 'react';
import {
    Box,
    Typography,
    Container,
    Divider,
    Paper,
    createTheme,
} from '@mui/material';
import { Margin } from '@mui/icons-material';
import MainRouteFooter from './routes/MainRouteFooter';

function PrivacyPolicy({ screenWidth, defaultTheme }) {
    return (
        <>
            <Box sx={{ bgcolor: '#f5fdf7', py: { xs: 4, md: 6 } }}>
                <Container sx={{maxWidth:'800px'}}>
                    {/* <Paper elevation={3} sx={{ p: { xs: 3, md: 5 }, borderRadius: 3 }}> */}
                    <Typography
                        variant="h4"
                        component="h1"
                        align="center"
                        gutterBottom
                        sx={{ fontWeight: 700, color: 'success.main' }}
                    >
                        นโยบายการคุ้มครองข้อมูลส่วนบุคคล
                    </Typography>
                    <Typography
                        variant="subtitle1"
                        align="center"
                        color="text.secondary"
                        gutterBottom
                    >
                        ปรับปรุงล่าสุด 6 ตุลาคม 2566
                    </Typography>
                    <Divider sx={{ my: 3 }} />

                    <Box>
                        {/* <Typography variant="h6" gutterBottom>
                            ปรับปรุงล่าสุด 6 ตุลาคม 2566
                        </Typography> */}

                        <Typography variant="body1" paragraph>
                            let'sgolowcarbon (ต่อไปนี้จะเรียกว่า “บริษัท” “เรา”) เป็นผู้ให้บริการเว็บไซต์{" "}
                            <strong>www.letsgolowcarbon.com</strong> (ต่อไปนี้จะเรียกว่า “บริการ”) ซึ่งมีการเก็บรวบรวม
                            ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการ (ต่อไปนี้จะเรียกว่า “คุณ” “ท่าน”) ซึ่งเป็นเจ้าของข้อมูลส่วนบุคคล
                            เราให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคล โดยมีนโยบายการคุ้มครองข้อมูลส่วนบุคคลตามที่กฎหมายกำหนด
                            ประกอบด้วยการแจ้งวัตถุประสงค์ของการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล ผลกระทบที่เป็นไปได้จากการไม่ให้ข้อมูลส่วนบุคคล
                            ข้อมูลที่จัดเก็บ ระยะเวลาที่จัดเก็บ บุคคลหรือหน่วยงานซึ่งข้อมูลส่วนบุคคลที่เก็บรวบรวมอาจจะถูกเปิดเผย
                            ข้อมูลของผู้ควบคุมข้อมูลส่วนบุคคล ข้อมูลของเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล ตลอดจนสิทธิของเจ้าของข้อมูลส่วนบุคคล
                            โดยมีรายละเอียดดังนี้
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">1. ช่องทางการเก็บรวบรวมข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            เราจะเก็บรวบรวมข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทางต่างๆ ดังต่อไปนี้
                            <br />
                            <li> จดหมายอิเล็กทรอนิกส์ (อีเมล) </li>
                            <li> เว็บไซต์ </li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">2. ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</Typography>
                        <Typography variant="body1" paragraph>
                            ข้อมูลทั่วไป<br />
                            <li>จดหมายอิเล็กทรอนิกส์ (อีเมล), ภาพถ่ายบุคคล<br /> </li>
                            ข้อมูลอ่อนไหว<br />
                            <li>เบอร์โทรศัพท์ </li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">3. ผู้เยาว์และบุคคลที่มีข้อจำกัดเรื่องความสามารถ</Typography>
                        <Typography variant="body1" paragraph>
                            ในกรณีที่คุณยังไม่บรรลุนิติภาวะ ถือเป็นผู้เยาว์ตามประมวลกฎหมายแพ่งและพาณิชย์ การให้ความยินยอมของคุณต้องได้รับความยินยอมจากผู้ใช้อำนาจปกครองที่มีอำนาจกระทำแทนคุณด้วย<br />
                            <li> อายุต่ำกว่า 10 ปี: ต้องได้รับความยินยอมจากผู้ใช้อำนาจปกครอง<br /> </li>
                            <li> บุคคลไร้ความสามารถ: ให้ผู้อนุบาลยินยอมแทน<br /> </li>
                            <li> บุคคลเสมือนไร้ความสามารถ: ให้ผู้พิทักษ์ยินยอมแทน </li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">4. วิธีการเก็บรักษาข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์หรือเอกสาร ดังนี้<br />
                            <li> เครื่องคอมพิวเตอร์ของบริษัท<br /> </li>
                            <li> เครื่องคอมพิวเตอร์ของผู้ให้บริการในประเทศไทย </li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">5. วัตถุประสงค์การจัดเก็บข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์ดังต่อไปนี้<br />
                            <li> เพื่อยืนยันตัวตนในการใช้สิทธิของเจ้าของข้อมูล<br /> </li>
                            <li> เพื่อแจ้งข้อมูล ขอความยินยอม แจ้งสถานะ หรือผลการดำเนินการ<br />  </li>
                            <li> เพื่อประโยชน์โดยชอบด้วยกฎหมายหรือเป็นไปตามกฎหมายหรือสัญญา</li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">6. การเปิดเผยข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            ประเภทของบุคคลหรือหน่วยงานซึ่งข้อมูลส่วนบุคคลที่เก็บรวบรวมอาจจะถูกเปิดเผยมีดังนี้ เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์ดังต่อไปนี้<br />
                            <li> เจ้าหน้าที่ที่ได้รับแต่งตั้งตาม พรบ.คุ้มครองข้อมูลส่วนบุคคล<br /> </li>
                            <li> คณะกรรมการผู้เชี่ยวชาญ<br /> </li>
                            <li> ศาล </li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">7. ระยะเวลาการจัดเก็บข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้เป็นระยะเวลา 3 ปีหลังจากที่คุณให้ความยินยอมล่าสุด เมื่อครบกำหนดเราจะดำเนินการทำให้ข้อมูลส่วนบุคคลของคุณเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลได้ด้วยการเข้ารหัส
                            อย่างไรก็ตามข้อมูลดังกล่าวจะถูกถอดรหัสเพื่อระบุตัวคุณในกรณีที่มีการร้องขอหรือมีคำสั่งจากพนักงานเจ้าหน้าที่ผู้ซึ่งรัฐมนตรีแต่งตั้งให้ปฏิบัติการตามพรบ.คุ้มครองข้อมูลส่วนบุคคล หรือคณะกรรมการผู้เชี่ยวชาญที่แต่งตั้งโดยคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล หรือศาล
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">8. สิทธิของเจ้าของข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            แม้ว่าคุณเคยยินยอมให้เราเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลแล้ว คุณสามารถใช้สิทธิตามที่พรบ.คุ้มครองข้อมูลส่วนบุคคลกำหนดให้กับเจ้าของข้อมูลส่วนบุคคล ดังต่อไปนี้<br />
                            <li> สิทธิขอถอนความยินยอม</li>
                            <li> สิทธิขอเข้าถึงและขอรับสำเนาข้อมูลส่วนบุคคล หรือขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลดังกล่าวที่ตนไม่ได้ให้ความยินยอม</li>
                            <li>สิทธิขอรับข้อมูลส่วนบุคคล หรือขอให้ผู้ควบคุมข้อมูลส่วนบุคคลส่งหรือโอนข้อมูลส่วนบุคคลไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่น</li>
                            <li> สิทธิคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล</li>
                            <li> สิทธิขอให้ผู้ควบคุมข้อมูลส่วนบุคคลดำเนินการลบ หรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของ</li>
                            ข้อมูลส่วนบุคคลได้
                            <li> สิทธิขอให้ผู้ควบคุมข้อมูลส่วนบุคคลระงับการใช้ข้อมูลส่วนบุคคล </li>
                            <li>สิทธิขอให้แก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด</li>
                            คุณสามารถใช้สิทธิดังกล่าวในฐานะเจ้าของข้อมูลส่วนบุคคล โดยส่งคำร้องด้วยตัวเองที่ อีเมล letsgolowcarbon@letsgolowcarbon.com เราจะแจ้งผลการดำเนินการ รวมถึงแจ้งเหตุผลที่เราปฏิเสธคำร้องขอใช้สิทธิของคุณ ภายในระยะเวลา 30 วัน
                            นับแต่วันที่เราได้รับคำร้องขอใช้สิทธิจากคุณ โดยเราจะแจ้งสถานะ รายละเอียด และผลการดำเนินการทางอีเมลของคุณเพื่อเก็บไว้เป็นหลักฐาน
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">9. ผลกระทบหากไม่ยินยอม</Typography>
                        <Typography variant="body1" paragraph>
                            เนื่องดัวยบริษัทใช้ Netka Data Privacy & Protection เป็นเครื่องมือในการบริหารจัดการสำหรับการคุ้มครองข้อมูลส่วนบุคคลเพื่ออำนวยความสะดวกให้กับเจ้าของข้อมูลส่วนบุคคล
                            หากคุณต้องการใช้สิทธิของคุณสำหรับบริการต่างๆ ของบริษัทเรา คุณจะต้องให้ความยินยอมนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ หากไม่ให้ความยินยอมคุณจะไม่สามารถส่งคำร้องขอใช้สิทธิ
                            ติดตามผลการดำเนินการได้ด้วยตัวเอง รวมถึงไม่ได้รับแจ้งสถานะ รายละเอียด และผลการดำเนินการทางอีเมลจากระบบอัตโนมัติ อย่างไรก็ตามคุณสามารถใช้สิทธิตามกฏหมายทุกประการด้วยการติดต่อเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราตามรายละเอียดด้านท้ายนโยบายนี้ <br />
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">10. การรักษาความมั่นคงปลอดภัย</Typography>
                        <Typography variant="body1" paragraph>
                            เรามีมาตรการรักษาความมั่นคงปลอดภัยเพื่อป้องกันการสูญหาย เข้าถึง ใช้เปลี่ยนแปลง แก้ไข หรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบ โดยมีการตรวจสอบการดำเนินการตามมาตรการเทียบกับตัวชี้วัด
                            และมีการตรวจสอบเป็นระยะอย่างต่อเนื่อง เพื่อให้คุณมั่นใจว่าบริการของเรามีการรักษาความมั่นคงปลอดภัยที่เหมาะสมสำหรับข้อมูลส่วนบุคคลของคุณ นอกจากนั้นแล้วเรายังมีการทบทวนมาตรการดังกล่าวเมื่อมีความจำเป็นหรือเมื่อเทคโนโลยีเปลี่ยนแปลงไปเพื่อให้การรักษาความมั่นคงปลอดภัยมีประสิทธิภาพเหมาะสมกับเทคโนโลยีและกาลเวลา <br />
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">11. การแก้ไขเปลี่ยนแปลงนโยบายการคุ้มครองข้อมูลส่วนบุคคล</Typography>
                        <Typography variant="body1" paragraph>
                            เราอาจมีการแก้ไขเปลี่ยนแปลงนโยบายนี้เมื่อมีวัตถุประสงค์ใหม่หรือมีความจำเป็นเพื่อให้บริการดีขึ้นหรือเพื่อให้เป็นไปตามกฎหมาย โดยเราจะขอความยินยอมจากคุณทุกครั้งเมื่อมีการเปลี่ยนแปลงแก้ไขนโยบาย <br />
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">12. รายละเอียดการติดต่อ</Typography>
                        <Typography variant="body1" paragraph>
                            หากคุณต้องการสอบถามข้อมูลเกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคลสำหรับบริการนี้ รวมถึงการขอใช้สิทธิ ตามพรบ.คุ้มครองข้อมูลส่วนบุคคล สามารถติดต่อเราได้ ดังนี้ <br /> <br />
                            <strong>ผู้ควบคุมข้อมูล:</strong>
                            <li> เอื้ออาทร วิบูลกุล | อีเมล: letsgolpwcarbon@gmail.com<br /></li><br />
                            <strong>เจ้าหน้าที่ DPO:</strong>
                            <li>ธนพล มุระดา | อีเมล: letsgolowcarbon@letsgolowcarbon.com</li>
                        </Typography>

                        <Typography variant="subtitle1" fontWeight="bold">ข้อสงวนสิทธิ์</Typography>
                        <Typography variant="body1" paragraph>
                            นโยบายการคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy) ฉบับนี้ ถือเป็นกรรมสิทธิ์ของเว็บไซต์ let'sgolowcarbon และสงวนลิขสิทธิ์ตามกฎหมาย ภายใต้กฎหมายลิขสิทธิ์ คุณไม่สามารถทำซ้ำข้อมูลใดๆ จากนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ (ทั้งหมดหรือบางส่วน) ปรับปรุง ดัดแปลง แก้ไข หรือส่งต่อ หรือใช้เพื่อการพาณิชย์ โดยไม่แจ้งบริษัท และได้รับอนุญาตอย่างเป็นลายลักษณ์อักษร
                        </Typography>
                    </Box>
                    {/* <Divider sx={{ my: 4 }} />
                    <Typography variant="body2" color="text.secondary">
                        © {new Date().getFullYear()} Let's Go Low Carbon. สงวนลิขสิทธิ์ตามกฎหมายลิขสิทธิ์
                    </Typography> */}
                    {/* </Paper> */}
                </Container>
            </Box>
            <Divider sx={{ my: 0 }} />
            <Box sx={{ bgcolor: '#f5fdf7', }}>
                <MainRouteFooter />
            </Box>

        </>
    )
}

export default PrivacyPolicy