{
  "home": "หน้าหลัก",
  "routes": "แนะนำเส้นทาง",
  "format": "รูปแบบ",
  "about": "เกี่ยวกับเรา",
  "contact": "ติดต่อ",
  "language": "ภาษา",
  "login": "เข้าสู่ระบบ",
  "logout": "ออกจากระบบ",
  "signup": "สมัคร",
  "admin": "ผู้ดูแลระบบ",
  "user": "ผู้ใช้งาน",
  "guest": "บุคคลทั่วไป",
  "dashboard": "หน้าเพิ่มข้อมูล",
  "current_role": "สิทธิ์ปัจจุบัน",
  "head_tourist_routes": "เส้นทางท่องเที่ยว",
  "route_mueang": [
    {
      "id": 1,
      "name": "เส้นทางที่ 1 อำเภอเมือง",
      "image": "/img-web/route1.jpg"
    },
    {
      "id": 2,
      "name": "เส้นทางที่ 2 อำเภอเมือง",
      "image": "/img-web/route2.jpg"
    },
    {
      "id": 3,
      "name": "เส้นทางที่ 3 อำเภอเมือง",
      "image": "/img-web/route3.jpg"
    }
  ],
  "route_phu_pha_man": [
    {
      "id": 1,
      "name": "เส้นทางที่ 1 อำเภอภูผาม่าน",
      "image": "/img-web/route1.jpg"
    },
    {
      "id": 2,
      "name": "เส้นทางที่ 2 อำเภอภูผาม่าน",
      "image": "/img-web/route2.jpg"
    }
  ],
  "route_ubolrat": [
    {
      "id": 1,
      "name": "เส้นทางที่ 1 อำเภออุบลรัตน์",
      "image": "/img-web/route1.jpg"
    },
    {
      "id": 2,
      "name": "เส้นทางที่ 2 อำเภออุบลรัตน์",
      "image": "/img-web/route2.jpg"
    }
  ],
  "route_phu_wiang": [
    {
      "id": 1,
      "name": "เส้นทางที่ 1 อำเภอภูเวียง",
      "image": "/img-web/route1.jpg"
    }
  ],
  "route_nam_phong": [
    {
      "id": 1,
      "name": "เส้นทางที่ 1 อำเภอน้ำพอง",
      "image": "/img-web/route1.jpg"
    },
    {
      "id": 2,
      "name": "เส้นทางที่ 2 อำเภอน้ำพอง",
      "image": "/img-web/route2.jpg"
    }
  ],
  "route_si_chomphu": [
    {
      "id": 1,
      "name": "เส้นทางที่ 1 อำเภอสีชมพู",
      "image": "/img-web/route1.jpg"
    },
    {
      "id": 2,
      "name": "เส้นทางที่ 2 อำเภอสีชมพู",
      "image": "/img-web/route2.jpg"
    }
  ],
  "districts": [
    {
      "id": "mueang",
      "name_th": "อำเภอเมือง",
      "name_en": "Muang District",
      "icon": "district-1.png"
    },
    {
      "id": "phu_pha_man",
      "name_th": "อำเภอภูผาม่าน",
      "name_en": "Phu Pha Man",
      "icon": "district-2.png"
    },
    {
      "id": "ubonrat",
      "name_th": "อำเภออุบลรัตน์",
      "name_en": "Ubolratana",
      "icon": "district-3.png"
    },
    {
      "id": "phu_wiang",
      "name_th": "อำเภอภูเวียง",
      "name_en": "Phu Wiang",
      "icon": "district-4.png"
    },
    {
      "id": "nam_phong",
      "name_th": "อำเภอน้ำพอง",
      "name_en": "Nam Phong",
      "icon": "district-5.png"
    },
    {
      "id": "si_chomphu",
      "name_th": "อำเภอสีชมพู",
      "name_en": "Si Chomphu",
      "icon": "district-6.png"
    }
  ],
  "formats": [
    {
      "id": "1",
      "name": "1 วัน",
      "name_en": "1 Day"
    },
    {
      "id": "2",
      "name": "2 วัน 1 คืน",
      "name_en": "2 Days 1 Night"
    },
    {
      "id": "3",
      "name": "3 วัน 2 คืน",
      "name_en": "3 Days 2 Nights"
    }
  ],
  "roles": [
    {
      "id": "guest",
      "name_th": "บุคคลทั่วไป",
      "name_en": "Guest"
    },
    {
      "id": "user",
      "name_th": "ผู้ใช้งาน",
      "name_en": "User"
    },
    {
      "id": "admin",
      "name_th": "ผู้ดูแลระบบ",
      "name_en": "Admin"
    }
  ],
  "menu": {
    "privacy_policy": "นโยบายความเป็นส่วนตัว",
    "terms": "เงื่อนไขและข้อตกลงการให้บริการ",
    "contacts": "ช่องทางการติดต่อ",
    "abouts": "เกี่ยวกับเรา"
  },
  "abouted": {
    "title": "เกี่ยวกับเรา",
    "what_is_lglc_title": "What is Let’s Go Low Carbon ?",
    "what_is_low_carbon_society_title": "What is Low Carbon Society ?",
    "what_is_carbon_footprint_title": "What is the Carbon footprint ?",
    "what_is_low_carbon_title": "What is Low Carbon ?",
    "origin_title": "The Origin of this Ideas",
    "what_is_lglc": "<p>Let’s Go Low Carbon เป็นเว็บไซต์ที่รวบรวมแหล่งท่องเที่ยว ที่พัก ร้านอาหาร ในจังหวัดขอนแก่นโดยมี 6 อำเภอ ได้แก่ อำเภอเมือง อำเภอภูผาม่าน อำเภออุบลรัตน์ อำเภอภูเวียง อำเภอน้ำพอง อำเภอสีชมพู เพื่อออกแบบและสร้างเส้นทางการกิจกรรมท่องเที่ยวภายใต้คาร์บอนสุทธิเป็นศูนย์ โดยภายในเว็บไซต์จะมีการคำนวณจำนวนปริมาณการปล่อยก๊าซคาร์บอนไดออกไซด์ของแต่ละแหล่งท่องเที่ยว เพื่อให้ท่านสามารถท่องเที่ยวได้อย่างมั่นใจว่าการเดินทางในครั้งนี้จะสามารถลดการปล่อยคาร์บอนไดออกไซด์และรบกวนสิ่งแวดล้อมน้อยที่สุด</p>",
    "what_is_low_carbon_society": "<p>สังคมคาร์บอนต่ำ เป็นสังคมที่ผู้คนส่วนใหญ่ ในสังคมหันมาร่วมมือกันลดการปล่อยก๊าซคาร์บอนไดออกไซด์ในทุกรูปแบบหรือในกิจกรรมต่างๆ ที่เกิดจากการดำรงชีวิตปกติโดยเฉพาะการลดปริมาณก๊าซคาร์บอนไดออกไซด์ที่ปล่อยออกมาจากกระบวนการผลิตของโรงงานหรือภาคอุตสาหกรรม เพื่อจะได้อยู่ร่วมกันในสังคมที่มีคุณภาพชีวิตที่ดี สังคมคาร์บอนต่ำจึงต้องทำให้ผู้คนในสังคมมีความตระหนักถึงคุณภาพชีวิตที่เกิดจากการอยู่ในสภาพแวดล้อมที่มีปริมาณคาร์บอนต่ำ โดยผู้คนในสังคมมีความยึดโยงกับการเลือกใช้เทคโนโลยีหรือการพัฒนาเทคโนโลยีให้เป็นมิตรกับสิ่งแวดล้อม และที่สำคัญก็คือ จะต้องเป็นสังคมที่มีการวางผังเมืองให้สอดคล้องกับระบบนิเวศที่สมดุลด้วย</p>",
    "what_is_carbon_footprint": "<p>คาร์บอนฟุตพริ้นท์ (Carbon Footprint) คือปริมาณการปล่อยและดูดกลับก๊าซเรือนกระจก (Greenhouse gas emissions and removals) ที่ปล่อยออกมาจากผลิตภัณฑ์หรือบริการตลอดวัฏจักรชีวิต หรือจากกิจกรรมการดำเนินงานขององค์กร วัดรวมอยู่ในรูปของตัน (กิโลกรัม) ของก๊าซคาร์บอนไดออกไซด์เทียบเท่า</p>",
    "what_is_low_carbon": "<p>Low Carbon Tourism คือ การท่องเที่ยวที่กำหนดกิจกรรมท่องเที่ยวที่มีการลดการปล่อยก๊าซคาร์บอน โดยจุดเริ่มต้นของการท่องเที่ยวคาร์บอนต่ำ เกิดจากทั่วโลกหันมาให้ความสำคัญกับภาวะโลกร้อน และอุตสาหกรรมท่องเที่ยวก็เป็นส่วนหนึ่งที่ก่อให้เกิดก๊าซคาร์บอนอันเป็นสาเหตุให้เกิดภาวะโลกร้อน หากจะพิจารณารอยเท้าคาร์บอนของการเดินทางท่องเที่ยว จะเห็นว่าแค่เราก้าวเท้าออกจากบ้านเพื่อไปท่องเที่ยวก็เกิดการปล่อยก๊าซคาร์บอนแล้ว ดังนั้น เมื่ออุตสาหกรรมท่องเที่ยวเป็นตัวการที่ทำให้เกิดการปล่อยก๊าซคาร์บอน หน่วยงานต่างๆ จึงช่วยกันคิดว่า “เที่ยวอย่างไรจึงจะปล่อยก๊าซคาร์บอนให้น้อยที่สุด” จึงเกิดแนวคิดของการท่องเที่ยวคาร์บอนต่ำ หรือ Low Carbon Tourism เพื่อให้เป็นรูปแบบการท่องเที่ยวที่ลดการปล่อยก๊าซคาร์บอน และรบกวนสิ่งแวดล้อมน้อยที่สุด</p>",
    "origin": "<p>เว็บไซต์ Let’s Go Low Carbon ก่อตั้งในปี พ.ศ. 2566 โดยนักศึกษาชั้นปีที่ 4 กลุ่มเรียนที่ 3 ของรายวิชา BS944011 การจัดโครงการการท่องเที่ยว สาขาการจัดการอุตสาหกรรมการท่องเที่ยว คณะบริหารธุรกิจและการบัญชี มหาวิทยาลัยขอนแก่น เนื่องจากคณะผู้จัดทำเล็งเห็นถึงความสำคัญและตระหนักรู้ถึงปัญหาที่เกิดขึ้นจากกิจกรรมการท่องเที่ยวตามสถานที่ท่องเที่ยวที่ล้วนส่งผลต่อการปล่อยก๊าซคาร์บอนไดออกไซด์สู่ชั้นบรรยากาศ ซึ่งเป็นส่วนเร่งให้เกิดภาวะโลกร้อนในอนาคต จึงเกิดความสนใจในการศึกษาเส้นทางการท่องเที่ยวในอำเภอเมือง อำเภอภูผาม่าน และอำเภออุบลรัตน์ จังหวัดขอนแก่น ว่าควรเดินทางและทำกิจกรรมทางการท่องเที่ยวอย่างไรให้เกิดการปล่อยก๊าซคาร์บอนน้อยที่สุด ซึ่งมีจุดมุ่งหมายเพื่อศึกษาและส่งเสริมเส้นทางการท่องเที่ยวรูปแบบใหม่ภายใต้การท่องเที่ยวคาร์บอนต่ำ และเพื่อนำเสนอเส้นทางการท่องเที่ยวคาร์บอนต่ำ ด้วยเหตุผลนี้จึงเกิดเป็นโครงการภายใต้ชื่อ ‟การจัดทำเส้นทางการท่องเที่ยวคาร์บอนต่ำ จังหวัดขอนแก่น”</p>",
    "website_origin": "<p>เว็บไซต์นี้เป็นส่วนหนึ่งของรายวิชา BS944011 การจัดการโครงการการท่องเที่ยว มีผู้ดูแลโครงการโดย ผศ.ดร.เมษ์ธาวิน พลโยธี</p>"
  }
}